Show / Hide Table of Contents
Class LoadOnSurface
Load on surface
Inheritance
System.Object
OpenObject
OpenElementId
LoadOnSurface
Inherited Members
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Loading
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass("CI.StructModel.Loading.LoadOnSurface,CI.Loading", "CI.StructModel.Loading.ILoadOnSurface,CI.BasicTypes")]
public class LoadOnSurface : OpenElementId
Constructors
Improve this Doc   View Source
LoadOnSurface()
Constructor
Declaration
public LoadOnSurface()
Properties
Improve this Doc   View Source
Direction
Load direction LCS or GCS
Declaration
public LoadDirection Direction { get; set; }
Property Value
 Type |  Description
 LoadDirection
Improve this Doc   View Source
Fx
Force in X direction
Declaration
public double Fx { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Fy
Force in Y direction
Declaration
public double Fy { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Fz
Force in Z direction
Declaration
public double Fz { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
Geometry
Gets, sets geometry of this LoadOnSurface
Declaration
public Region3D Geometry { get; set; }
Property Value
 Type |  Description
 Region3D
 Improve this Doc
 View Source